In [26]:
import pandas as pd;

area = pd.Series({'California': 423967, 'Texas': 695662,
                    'New York': 141297, 'Florida': 170312,
                    'Illinois': 149995})

pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                'New York': 19651127, 'Florida': 19552860,
                'Illinois': 12882135})

data = pd.DataFrame({'Area': area, 'Pop': pop})
data['density'] = data['Pop'] / data['Area']

data

              Area       Pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [2]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [ ]:
data.T #transponse de full DataFrame

           California         Texas      New York       Florida      Illinois
Area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
Pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [4]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [9]:
data.iloc[:3, :2]

              Area       Pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [10]:
data.loc[:'Illinois', :'Pop']

              Area       Pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [18]:
data.loc[data.density > 100, ['Pop', 'density']]

               Pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [27]:
data.iloc[0, 2] = 90
data

              Area       Pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [28]:
#additional index conventions
data['Florida':'Illinois']

            Area       Pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [32]:
data[1:3]

            Area       Pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [33]:
data[data.density > 100]

            Area       Pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121